GD32-MCU-IOT/gd32_zephyr/include/zephyr/dt-bindings/clock/gd32g5x3-clocks.h
/*
 * Copyright (c) 2026 GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32G5X3_CLOCKS_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32G5X3_CLOCKS_H_

#include "gd32-clocks-common.h"

/**
 * @name Register offsets
 * @{
 */

#define GD32_AHB1EN_OFFSET       0x30U
#define GD32_AHB2EN_OFFSET       0x34U
#define GD32_AHB3EN_OFFSET       0x38U
#define GD32_APB1EN_OFFSET       0x40U
#define GD32_APB2EN_OFFSET       0x44U
#define GD32_APB3EN_OFFSET       0x48U

/** @} */

/**
 * @name Clock enable/disable definitions for peripherals
 * @{
 */

/* AHB1 peripherals */
#define GD32_CLOCK_CRC		GD32_CLOCK_CONFIG(AHB1EN, 12U)
#define GD32_CLOCK_CLA		GD32_CLOCK_CONFIG(AHB1EN, 15U)
#define GD32_CLOCK_DMA0		GD32_CLOCK_CONFIG(AHB1EN, 21U)
#define GD32_CLOCK_DMA1		GD32_CLOCK_CONFIG(AHB1EN, 22U)
#define GD32_CLOCK_DMAMUX	GD32_CLOCK_CONFIG(AHB1EN, 23U)
#define GD32_CLOCK_FFT		GD32_CLOCK_CONFIG(AHB1EN, 31U)

/* AHB2 peripherals */
#define GD32_CLOCK_FAC		GD32_CLOCK_CONFIG(AHB2EN, 1U)
#define GD32_CLOCK_CAU		GD32_CLOCK_CONFIG(AHB2EN, 3U)
#define GD32_CLOCK_TRNG		GD32_CLOCK_CONFIG(AHB2EN, 6U)
#define GD32_CLOCK_TMU		GD32_CLOCK_CONFIG(AHB2EN, 7U)
#define GD32_CLOCK_GPIOA	GD32_CLOCK_CONFIG(AHB2EN, 17U)
#define GD32_CLOCK_GPIOB	GD32_CLOCK_CONFIG(AHB2EN, 18U)
#define GD32_CLOCK_GPIOC	GD32_CLOCK_CONFIG(AHB2EN, 19U)
#define GD32_CLOCK_GPIOD	GD32_CLOCK_CONFIG(AHB2EN, 20U)
#define GD32_CLOCK_GPIOE	GD32_CLOCK_CONFIG(AHB2EN, 21U)
#define GD32_CLOCK_GPIOF	GD32_CLOCK_CONFIG(AHB2EN, 22U)
#define GD32_CLOCK_GPIOG	GD32_CLOCK_CONFIG(AHB2EN, 23U)

/* AHB3 peripherals */
#define GD32_CLOCK_EXMC		GD32_CLOCK_CONFIG(AHB3EN, 0U)
#define GD32_CLOCK_QSPI		GD32_CLOCK_CONFIG(AHB3EN, 1U)

/* APB1 peripherals */
#define GD32_CLOCK_TIMER1	GD32_CLOCK_CONFIG(APB1EN, 0U)
#define GD32_CLOCK_TIMER2	GD32_CLOCK_CONFIG(APB1EN, 1U)
#define GD32_CLOCK_TIMER3	GD32_CLOCK_CONFIG(APB1EN, 2U)
#define GD32_CLOCK_TIMER4	GD32_CLOCK_CONFIG(APB1EN, 3U)
#define GD32_CLOCK_TIMER5	GD32_CLOCK_CONFIG(APB1EN, 4U)
#define GD32_CLOCK_TIMER6	GD32_CLOCK_CONFIG(APB1EN, 5U)
#define GD32_CLOCK_LPTIMER	GD32_CLOCK_CONFIG(APB1EN, 9U)
#define GD32_CLOCK_WWDGT	GD32_CLOCK_CONFIG(APB1EN, 11U)
#define GD32_CLOCK_SPI1		GD32_CLOCK_CONFIG(APB1EN, 14U)
#define GD32_CLOCK_SPI2		GD32_CLOCK_CONFIG(APB1EN, 15U)
#define GD32_CLOCK_USART1	GD32_CLOCK_CONFIG(APB1EN, 17U)
#define GD32_CLOCK_USART2	GD32_CLOCK_CONFIG(APB1EN, 18U)
#define GD32_CLOCK_UART3	GD32_CLOCK_CONFIG(APB1EN, 19U)
#define GD32_CLOCK_UART4	GD32_CLOCK_CONFIG(APB1EN, 20U)
#define GD32_CLOCK_I2C0		GD32_CLOCK_CONFIG(APB1EN, 21U)
#define GD32_CLOCK_I2C1		GD32_CLOCK_CONFIG(APB1EN, 22U)
#define GD32_CLOCK_I2C2		GD32_CLOCK_CONFIG(APB1EN, 23U)
#define GD32_CLOCK_I2C3		GD32_CLOCK_CONFIG(APB1EN, 24U)
#define GD32_CLOCK_PMU		GD32_CLOCK_CONFIG(APB1EN, 28U)

/* APB2 peripherals */
#define GD32_CLOCK_TIMER0	GD32_CLOCK_CONFIG(APB2EN, 0U)
#define GD32_CLOCK_TIMER7	GD32_CLOCK_CONFIG(APB2EN, 1U)
#define GD32_CLOCK_VREF		GD32_CLOCK_CONFIG(APB2EN, 2U)
#define GD32_CLOCK_CMP		GD32_CLOCK_CONFIG(APB2EN, 3U)
#define GD32_CLOCK_USART0	GD32_CLOCK_CONFIG(APB2EN, 4U)
#define GD32_CLOCK_CAN0		GD32_CLOCK_CONFIG(APB2EN, 8U)
#define GD32_CLOCK_CAN1		GD32_CLOCK_CONFIG(APB2EN, 9U)
#define GD32_CLOCK_CAN2		GD32_CLOCK_CONFIG(APB2EN, 10U)
#define GD32_CLOCK_SPI0		GD32_CLOCK_CONFIG(APB2EN, 12U)
#define GD32_CLOCK_SYSCFG	GD32_CLOCK_CONFIG(APB2EN, 14U)
#define GD32_CLOCK_TIMER19	GD32_CLOCK_CONFIG(APB2EN, 15U)
#define GD32_CLOCK_TIMER14	GD32_CLOCK_CONFIG(APB2EN, 16U)
#define GD32_CLOCK_TIMER15	GD32_CLOCK_CONFIG(APB2EN, 17U)
#define GD32_CLOCK_TIMER16	GD32_CLOCK_CONFIG(APB2EN, 18U)
#define GD32_CLOCK_HPDF		GD32_CLOCK_CONFIG(APB2EN, 19U)
#define GD32_CLOCK_HRTIMER	GD32_CLOCK_CONFIG(APB2EN, 29U)
#define GD32_CLOCK_TRIGSEL	GD32_CLOCK_CONFIG(APB2EN, 31U)

/* APB3 peripherals */
#define GD32_CLOCK_ADC0		GD32_CLOCK_CONFIG(APB3EN, 8U)
#define GD32_CLOCK_ADC1		GD32_CLOCK_CONFIG(APB3EN, 9U)
#define GD32_CLOCK_ADC2		GD32_CLOCK_CONFIG(APB3EN, 10U)
#define GD32_CLOCK_ADC3		GD32_CLOCK_CONFIG(APB3EN, 11U)
#define GD32_CLOCK_DACHOLD	GD32_CLOCK_CONFIG(APB3EN, 16U)
#define GD32_CLOCK_DAC		GD32_CLOCK_CONFIG(APB3EN, 17U)

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32G5X3_CLOCKS_H_ */
